# YOLO-GHS 🚀, based on Ultralytics YOLOv11 architecture
# YOLO-GHS object detection model with GhostHGNetV2 backbone and Detect_SEAM head.

# Parameters
nc: 5 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # Baseline YOLOv11n scale parameters

# YOLO-GHS (GhostHGNetV2) backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, Ghost_HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, Ghost_HGBlock, [96, 512, 3]]   # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P4/16
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P5/32
  - [-1, 6, Ghost_HGBlock, [384, 2048, 5, True, False]]  # stage 4
  - [-1, 1, SPPF, [1024, 5]]  # 10
  - [-1, 2, C2PSA, [1024]] # 11

# YOLO-GHS head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect_SEAM, [nc]] # Custom Detect(P3, P4, P5) with SEAM
